In [1]:
data <- read.csv("customer.csv")

head(data)

  ID     Gender Ever_Married Age Graduated Profession    Work_Experience
1 462809 Male   No           22  No        Healthcare     1
2 462643 Female Yes          38  Yes       Engineer      NA
3 466315 Female Yes          67  Yes       Engineer       1
4 461735 Male   Yes          67  Yes       Lawyer         0
5 462669 Female Yes          40  Yes       Entertainment NA
6 461319 Male   Yes          56  No        Artist         0
  Spending_Score Family_Size Var_1
1 Low            4           Cat_4
2 Average        3           Cat_4
3 Low            1           Cat_6
4 High           2           Cat_6
5 High           6           Cat_6
6 Average        2           Cat_6

In [3]:
library(Hmisc)
describe(data)

Loading required package: lattice

Loading required package: survival

Loading required package: Formula

Loading required package: ggplot2


Attaching package: 'Hmisc'


The following objects are masked from 'package:base':

    format.pval, units

data

 10  Variables      10695  Observations
--------------------------------------------------------------------------------
ID
       n  missing distinct     Info     Mean      Gmd      .05      .10
   10695        0     8363        1   463468     3003   459422   459867
     .25      .50      .75      .90      .95
  461221   463451   465734   467086   467520

lowest : 458982 458983 458984 458985 458986, highest: 467969 467971 467972 467973 467974
--------------------------------------------------------------------------------
Gender
       n  missing distinct
   10695        0        2

Value      Female   Male
Frequency    4854   5841
Proportion  0.454  0.546
--------------------------------------------------------------------------------
Ever_Married
       n  missing distinct
   10505      190        2

Value         No   Yes
Frequency   4342  6163
Proportion 0.413 0.587
--------------------------------------------------------------------------------
Age
       n  missing distinct     Info     Mean      Gmd      .05      .10
   10695        0       67        1    43.51    18.75       20       25
     .25      .50      .75      .90      .95
      30       41       53       69       77

lowest : 18 19 20 21 22, highest: 85 86 87 88 89
--------------------------------------------------------------------------------
Graduated
       n  missing distinct
   10593      102        2

Value        No  Yes
Frequency  4023 6570
Proportion 0.38 0.62
--------------------------------------------------------------------------------
Profession
       n  missing distinct
   10533      162        9

lowest : Artist        Doctor        Engineer      Entertainment Executive
highest: Executive     Healthcare    Homemaker     Lawyer        Marketing

Artist (3318, 0.315), Doctor (930, 0.088), Engineer (935, 0.089), Entertainment
(1250, 0.119), Executive (775, 0.074), Healthcare (1750, 0.166), Homemaker
(328, 0.031), Lawyer (844, 0.080), Marketing (403, 0.038)
--------------------------------------------------------------------------------
Work_Experience
       n  missing distinct     Info     Mean      Gmd      .05      .10
    9597     1098       15    0.931     2.62    3.366        0        0
     .25      .50      .75      .90      .95
       0        1        4        8        9

lowest :  0  1  2  3  4, highest: 10 11 12 13 14

Value          0     1     2     3     4     5     6     7     8     9    10
Frequency   3087  3127   373   337   346   270   265   256   612   613    64
Proportion 0.322 0.326 0.039 0.035 0.036 0.028 0.028 0.027 0.064 0.064 0.007

Value         11    12    13    14
Frequency     64    60    57    66
Proportion 0.007 0.006 0.006 0.007
--------------------------------------------------------------------------------
Spending_Score
       n  missing distinct
   10695        0        3

Value      Average    High     Low
Frequency     2599    1602    6494
Proportion   0.243   0.150   0.607
--------------------------------------------------------------------------------
Family_Size
       n  missing distinct     Info     Mean      Gmd
   10247      448        9    0.951    2.844    1.648

lowest : 1 2 3 4 5, highest: 5 6 7 8 9

Value          1     2     3     4     5     6     7     8     9
Frequency   1965  3158  1952  1823   812   290   122    65    60
Proportion 0.192 0.308 0.190 0.178 0.079 0.028 0.012 0.006 0.006
--------------------------------------------------------------------------------
Var_1
       n  missing distinct
   10587      108        7

lowest : Cat_1 Cat_2 Cat_3 Cat_4 Cat_5, highest: Cat_3 Cat_4 Cat_5 Cat_6 Cat_7

Value      Cat_1 Cat_2 Cat_3 Cat_4 Cat_5 Cat_6 Cat_7
Frequency    167   563  1089  1475   114  6910   269
Proportion 0.016 0.053 0.103 0.139 0.011 0.653 0.025
--------------------------------------------------------------------------------

In [4]:
drops <- c("Var_1")
data <- data[ ,!(names(data) %in% drops)]

head(data)

  ID     Gender Ever_Married Age Graduated Profession    Work_Experience
1 462809 Male   No           22  No        Healthcare     1
2 462643 Female Yes          38  Yes       Engineer      NA
3 466315 Female Yes          67  Yes       Engineer       1
4 461735 Male   Yes          67  Yes       Lawyer         0
5 462669 Female Yes          40  Yes       Entertainment NA
6 461319 Male   Yes          56  No        Artist         0
  Spending_Score Family_Size
1 Low            4
2 Average        3
3 Low            1
4 High           2
5 High           6
6 Average        2

### Checking for Missing Values

In [6]:
#handling black values and NA values:
data[data==""] <- NA

lapply(data, function(x) {length(which(is.na(x)))})

$ID
[1] 0

$Gender
[1] 0

$Ever_Married
[1] 190

$Age
[1] 0

$Graduated
[1] 102

$Profession
[1] 162

$Work_Experience
[1] 1098

$Spending_Score
[1] 0

$Family_Size
[1] 448

### Replacing with mode for categorical and mean for continuous

In [ ]:
getmode <- function(v) {
    uniqv <- unique(v)
    uniqv[which.max(tabulate(match(v, uniqv)))]
}

In [ ]:
data$Ever_Married[is.na(data$Ever_Married)] <- getmode(data$Ever_Married)
data$Graduated[is.na(data$Graduated)] <- getmode(data$Graduated)
data$Profession[is.na(data$Profession)] <- getmode(data$Profession)
data$Work_Experience[is.na(data$Work_Experience)] <-mean(data$Work_Experience, na.rm = TRUE)